[
  {
    "path": "posts/2022-10-04-Statistical_Inferences/",
    "title": "Statistical Inferences",
    "description": "How do we make inferences that are \"statsitically sound\"?",
    "author": [
      {
        "name": "K Raman",
        "url": "https://raman-k.github.io/"
      }
    ],
    "date": "2022-10-04",
    "categories": [],
    "contents": "\r\nA statistic is a function of sample data. The sum, average, variance or standard deviation of the sample data are examples of a statistic. Since a statistic is itself a function of sample from a random process, it will exhibit randomness. So, how do we make sound inferences about processes that are random?\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-10-04T19:54:49+05:30",
    "input_file": "stat_infer.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to manfactuRail",
    "description": "Hi! I am a mechanical engineer with the Indian Railways. I've been with the organization for over 30 years now. My experience is in the areas of maintenance, repair and manufacture of rolling stock. I am passionate about manufacturing - in particular about applying scientific methods to analyze and improve manufacturing operations.",
    "author": [
      {
        "name": "K Raman",
        "url": "https://raman-k.github.io/"
      }
    ],
    "date": "2022-10-04",
    "categories": [],
    "contents": "\r\nManufacturing, maintenance and repair of railway rolling stock require a strong technical foundation. In this blog, I will use the term manufacturing to cover maintenance, repair and manufacturing.\r\nThe institutional knowledge within the technical cadres of Indian Railways, is deep and strong. The cadres comprise of a diverse set of personnel starting from technicians to senior managers. Each sub-set of the cadre brings with it a set of competencies.\r\nWhile the junior levels in the cadre are a repository of practical experience, they often lack the ability to articulate their thoughts in a manner that leads to better decision making. At the same time, in most cases, they are limited by the experience that they have gained in their careers.\r\nThe senior managers come with a strong theoretical background in engineering. At least in the initial part of their careers, they lack experience in the specialized areas of rolling stock manufacturing. Even with many years of experience, they do not have a thorough “hands-on” feel of what goes into the activities related to manufacturing of rolling stock. They however bring to the table the much needed breadth of perspective - ranging from strategic planning, selection of technology, identifying training needs etc.\r\nBetween these two levels is the sub-set of supervisors. Apart from functioning as field level managers in a 24x7x365 mode of operation, they serve as a bridge between the technicians and the senior managers. In many ways, they are the back bone of the technical cadre - as they ensure continuity of operational strategies that have been established over the years.\r\nThe entire cadre exists to carry out activities pertaining to manufacture of rolling stock - and to solve problems that are encountered in course of pursuing these activities.\r\nThere are two common approaches to solving these problems. The first is to identify the symptom and treat it and hope that the symptom is also the root cause. The second approach is to go one step further and “modify” the system. Some of the common examples of this are one or more of the following:\r\nAdd redundancy\r\nIncrease the frequency of maintenance attention\r\nProvide a “by-passing” feature\r\nOften, these steps do not guarantee a permanent fix to the problem. Because, the system is not well understood, we introduce “rules” to control the problems. Some of these include launching a “drive” to weed out potential failures, increasing the frequency and level of “inspection”, fixing responsibility on personnel etc.\r\nIn this blog I argue that there is a third alternative - adopting scientific methods to examine the problem. This approach is seldom pursued. We need to understand the system from the basics and approach the problem by asking “What is the cause?” rather than “who is responsible?”.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-10-04T20:56:15+05:30",
    "input_file": "welcome.knit.md"
  }
]
