[
  {
    "path": "posts/welcome/",
    "title": "Welcome to manfactuRail",
    "description": "Hi! I am a mechanical engineer with the Indian Railways. I've been with the organization for over 30 years now. My experience is in the areas of maintenance, repair and manufacture of rolling stock.",
    "author": [
      {
        "name": "K Raman",
        "url": "https://raman-k.github.io/"
      }
    ],
    "date": "2022-10-04",
    "categories": [],
    "contents": "\r\nThere are two views about factories that are very\r\nwidespread.\r\n1.     \r\nOne is that factories are huge messes that cannot\r\npossibly be understood, and at the best that anyone can do is to overbuild them\r\nand then, react to unwelcome events as they happen.\r\n2.     \r\nThe other is that factories can be understood, but only\r\ndesigned and operated using common sense, non-quantitative methods.\r\n1.     \r\nThe message here is that we can treat factories with\r\nquantitative engineering approaches and methods.\r\n2.     \r\nComplex systems can be\r\nhard to manage. And when a system is not well-understood, rules for management\r\nproliferate. This is because rules are developed to regulate behavior. Behavior\r\nrefers to how the system behaves and how it reacts to events. Good rules\r\npromote desirable behavior. Bad rules promote bad behavior. But bad rules can\r\nlead to unexpected, undesirable behavior. Why? Because the system is not\r\nwell-understood. If you don’t understand how a system works, you won’t design\r\nrules that lead to desirable behavior and desirable performance. Once somebody\r\nsees that things aren’t going so well, they develop new rules to regulate the\r\nnew behavior. But these new rules won’t be so good for the same reason. You\r\ndon’t understand the system. You see the bad behavior, and you develop still\r\nmore rules, and so forth. Whenever you see a complicated system in which there\r\nare large, large numbers of rules, that may be a sign that the system is not\r\nwell-understood, and you have to go back to basics to really understand it.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-10-04T19:41:33+05:30",
    "input_file": "welcome.knit.md"
  },
  {
    "path": "posts/2022-10-04-Statistical_Inferences/",
    "title": "Statistical Inferences",
    "description": "How do we make inferences that are \"statsitically sound\"?",
    "author": [
      {
        "name": "K Raman",
        "url": "https://raman-k.github.io/"
      }
    ],
    "date": "2022-10-04",
    "categories": [],
    "contents": "\r\nA statistic is a function of sample data. The sum, average, variance or standard deviation of the sample data are examples of a statistic. Since a statistic is itself a function of sample from a random process, it will exhibit randomness. So, how do we make sound inferences about processes that are random?\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-10-04T19:54:49+05:30",
    "input_file": "stat_infer.knit.md"
  }
]
